{
  "architectures": ["XrayReportGenerator"],
  "model_type": "xray_report_generator",
  "_from_auto_class": ["AutoModel"],
  "trust_remote_code": true,
  "auto_map": {
    "AutoModel": "model.XrayReportGenerator"
  },
  "biomedclip_model_name": "hf-hub:microsoft/BiomedCLIP-PubMedBERT_256-vit_base_patch16_224",
  "biogpt_base_model": "microsoft/biogpt",
  "qformer_config": {
    "hidden_size": 768,
    "num_hidden_layers": 6,
    "num_attention_heads": 12,
    "intermediate_size": 3072,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "attention_probs_dropout_prob": 0.1,
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-12,
    "add_cross_attention": true,
    "cross_attention_freq": 1,
    "encoder_width": 512,
    "num_query_tokens": 32,
    "gradient_checkpointing": false,
    "vocab_size": 30522,
    "max_position_embeddings": 512,
    "pad_token_id": 0,
    "position_embedding_type": "absolute"
  },
  "max_seq_length": 256
}